Revit 2026 API

# ConnectorGetFabricationConnectorInfo Method

---

Gets fabrication connectivity information.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FabricationConnectorInfo GetFabricationConnectorInfo()
```
```vb
Public Function GetFabricationConnectorInfo As FabricationConnectorInfo
```
```cpp
public:
FabricationConnectorInfo^ GetFabricationConnectorInfo()
```
```fsharp
member GetFabricationConnectorInfo : unit -> FabricationConnectorInfo
```

#### Return Value

FabricationConnectorInfo Returns  if there is no fabrication connector information associated.

#### Reference

Connector Class

Autodesk.Revit.DB Namespace